[
  { "ch": "北京", "pin": "Běijīng", "en": "Beijing", "sp": "Pekín", "x": 372, "y": 159, "en": "Capital of China with over 3,000 years of history. Home to the Forbidden City and the Great Wall.", "es": "Capital de China con más de 3,000 años de historia. Hogar de la Ciudad Prohibida y la Gran Muralla." },
  { "ch": "上海", "pin": "Shànghǎi", "en": "Shanghai", "sp": "Shanghái", "x": 422, "y": 250,  "en": "Global financial hub with China's most impressive skyline. Known as the 'Pearl of the Orient'.", "es": "Centro financiero global con el skyline más impresionante de China. Conocida como la 'Perla de Oriente'."},
  { "ch": "广州", "pin": "Guǎngzhōu", "en": "Guangzhou", "sp": "Cantón", "x": 343, "y": 348, "en": "Capital of Guangdong, historic commercial center and host of the Canton Fair.", "es": "Capital de Guangdong, centro comercial histórico y sede de la Feria de Cantón."},
  { "ch": "成都", "pin": "Chéngdū", "en": "Chengdu", "sp": "Chengdú", "x": 252, "y": 260, "en": "Capital of Sichuan, famous for its spicy cuisine and the Giant Panda Breeding Center.", "es":  "Capital de Sichuan, famosa por su comida picante y el Centro de Cría de Pandas Gigantes."},
  { "ch": "西安", "pin": "Xī'ān", "en": "Xi'an", "sp": "Xi'an", "x": 300, "y": 218, "en": "Ancient capital with the Terracotta Warriors. Final stop of the Silk Road.", "es":  "Antigua capital con los Guerreros de Terracota. Punto final de la Ruta de la Seda."},
  { "ch": "拉萨", "pin": "Lāsà", "en": "Lhasa", "sp": "Lhasa", "x": 145, "y": 270, "en": "Capital of Tibet, sacred city with the Potala Palace at 3,650m altitude.", "es":  "Capital del Tíbet, ciudad sagrada con el Palacio Potala a 3,650m de altitud."},
  { "ch": "香港", "pin": "Xiānggǎng", "en": "Hong Kong", "sp": "Hong Kong", "x": 360, "y": 353, "en": "Special administrative region, global financial center with a unique cultural blend.", "es":  "Región administrativa especial, centro financiero global con mezcla única de culturas."},
  { "ch": "台北", "pin": "Táiběi", "en": "Taipei", "sp": "Taipéi", "x": 435, "y": 318, "en": "Capital of Taiwan, famous for Taipei 101 skyscraper and vibrant nightlife.", "es":  "Capital de Taiwán, famosa por el rascacielos Taipei 101 y la vibrante vida nocturna."},
  { "ch": "南京", "pin": "Nánjīng", "en": "Nanjing", "sp": "Nankín", "x": 382, "y": 226, "en": "Former capital with the Sun Yat-sen Mausoleum and Ming dynasty memorials.", "es":  "Antigua capital con el Mausoleo de Sun Yat-sen y memoriales de la dinastía Ming."},
  { "ch": "杭州", "pin": "Hángzhōu", "en": "Hangzhou", "sp": "Hangzhou", "x": 411, "y": 264, "en": "Famous for West Lake, 'the most beautiful city under heaven' according to Marco Polo.", "es":  "Famosa por el Lago del Oeste, 'la ciudad más hermosa bajo el cielo' según Marco Polo." },
  { "ch": "桂林", "pin": "Guìlín", "en": "Guilin", "sp": "Guilin", "x": 324, "y": 317, "en": "Renowned for its stunning karst mountains and river landscapes. A top destination for natural beauty.", "es": "Famosa por sus montañas kársticas y paisajes fluviales. Un destino destacado por su belleza natural." },
  { "ch": "苏州", "pin": "Sūzhōu", "en": "Suzhou", "sp": "Suzhou", "x": 413, "y": 248, "en": "Known for its classical gardens, silk industry, and ancient canals. Often called the 'Venice of the East.'", "es": "Conocida por sus jardines clásicos, industria de la seda y antiguos canales. A menudo llamada la 'Venecia de Oriente'." },
  { "ch": "重庆", "pin": "Chóngqìng", "en": "Chongqing", "sp": "Chongqing", "x": 268, "y": 263, "en": "One of China’s largest cities, famous for spicy hotpot, mountainous terrain, and rapid urban growth.", "es": "Una de las ciudades más grandes de China, famosa por el hotpot picante, su terreno montañoso y rápido desarrollo urbano." },
  { "ch": "天津", "pin": "Tiānjīn", "en": "Tianjin", "sp": "Tianjín", "x": 376, "y": 175, "en": "Major port city with colonial architecture and modern industry. Gateway to northern China.", "es": "Importante ciudad portuaria con arquitectura colonial e industria moderna. Puerta de entrada al norte de China." },
  { "ch": "武汉", "pin": "Wǔhàn", "en": "Wuhan", "sp": "Wuhan", "x": 350, "y": 262, "en": "Central Chinese metropolis at the Yangtze River. Known for universities, bridges, and historical districts.", "es": "Metrópoli del centro de China junto al río Yangtsé. Conocida por sus universidades, puentes y barrios históricos." },
  { "ch": "深圳", "pin": "Shēnzhèn", "en": "Shenzhen", "sp": "Shenzhen", "x": 353, "y": 353, "en": "High-tech hub and innovation center. Transformed from fishing village to global metropolis in decades.", "es": "Centro tecnológico e innovador. De aldea pesquera a metrópoli global en pocas décadas." },
  { "ch": "青岛", "pin": "Qīngdǎo", "en": "Qingdao", "sp": "Qingdao", "x": 409, "y": 195, "en": "Coastal city known for its German heritage, beaches, and Tsingtao beer.", "es": "Ciudad costera conocida por su herencia alemana, playas y cerveza Tsingtao." },
  { "ch": "郑州", "pin": "Zhèngzhōu", "en": "Zhengzhou", "sp": "Zhengzhou", "x": 340, "y": 204, "en": "Capital of Henan province, major transport hub and historical cradle of Chinese civilization.", "es": "Capital de la provincia de Henan, importante centro de transporte y cuna histórica de la civilización china." },
  { "ch": "长沙", "pin": "Chángshā", "en": "Changsha", "sp": "Changsha", "x": 340, "y": 289, "en": "Capital of Hunan, known for spicy food, vibrant culture, and historical sites.", "es": "Capital de Hunan, conocida por su comida picante, cultura vibrante y sitios históricos." },
  { "ch": "合肥", "pin": "Héféi", "en": "Hefei", "sp": "Hefei", "x": 389, "y": 244, "en": "Capital of Anhui province, emerging tech and education center in central China.", "es": "Capital de la provincia de Anhui, centro emergente de tecnología y educación en el centro de China." },
  { "ch": "昆明", "pin": "Kūnmíng", "en": "Kunming", "sp": "Kunming", "x": 240, "y": 326, "en": "Capital of Yunnan, known as the 'Spring City' for its mild climate and ethnic diversity.", "es": "Capital de Yunnan, conocida como la 'Ciudad de la Primavera' por su clima templado y diversidad étnica." },
  { "ch": "哈尔滨", "pin": "Hā'ěrbīn", "en": "Harbin", "sp": "Harbin", "x": 443, "y": 79, "en": "Northern city famous for its Ice and Snow Festival and Russian-influenced architecture.", "es": "Ciudad del norte famosa por su Festival de Hielo y Nieve y arquitectura de influencia rusa." },
  { "ch": "济南", "pin": "Jǐnán", "en": "Jinan", "sp": "Jinan", "x": 371, "y": 174, "en": "Capital of Shandong, known as the 'City of Springs' for its many natural artesian wells.", "es": "Capital de Shandong, conocida como la 'Ciudad de los Manantiales' por sus numerosos pozos artesianos." },
  { "ch": "南昌", "pin": "Nánchāng", "en": "Nanchang", "sp": "Nanchang", "x": 360, "y": 248, "en": "Capital of Jiangxi province, historical revolutionary base and growing industrial city.", "es": "Capital de la provincia de Jiangxi, base revolucionaria histórica y ciudad industrial en crecimiento." },
  { "ch": "石家庄", "pin": "Shíjiāzhuāng", "en": "Shijiazhuang", "sp": "Shijiazhuang", "x": 346, "y": 160, "en": "Capital of Hebei province, key transport and manufacturing center in northern China.", "es": "Capital de la provincia de Hebei, centro clave de transporte y manufactura en el norte de China." },
  { "ch": "烟台", "pin": "Yāntái", "en": "Yantai", "sp": "Yantai", "x": 397, "y": 154, "en": "Coastal city in Shandong, known for seafood, wine production, and scenic coastline.", "es": "Ciudad costera en Shandong, conocida por sus mariscos, producción de vino y costa pintoresca." },
  { "ch": "福州", "pin": "Fúzhōu", "en": "Fuzhou", "sp": "Fuzhou", "x": 406, "y": 309, "en": "Capital of Fujian province, gateway to Taiwan and known for traditional architecture.", "es": "Capital de la provincia de Fujian, puerta de entrada a Taiwán y conocida por su arquitectura tradicional." },
  { "ch": "太原", "pin": "Tàiyuán", "en": "Taiyuan", "sp": "Taiyuan", "x": 340, "y": 190, "en": "Capital of Shanxi province, rich in coal resources and ancient temples.", "es": "Capital de la provincia de Shanxi, rica en recursos de carbón y templos antiguos." },
  { "ch": "温州", "pin": "Wēnzhōu", "en": "Wenzhou", "sp": "Wenzhou", "x": 418, "y": 297, "en": "Coastal city in Zhejiang, famous for entrepreneurship and private economy.", "es": "Ciudad costera en Zhejiang, famosa por su espíritu emprendedor y economía privada." },
  { "ch": "南宁", "pin": "Nánníng", "en": "Nanning", "sp": "Nanning", "x": 290, "y": 340, "en": "Capital of Guangxi, gateway to Southeast Asia and known for lush greenery.", "es": "Capital de Guangxi, puerta de entrada al sudeste asiático y conocida por su vegetación exuberante." }

]
